#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws02/runs/run-MHgQAwyXFNGzheu6

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.ansibleexec.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:531133914787:cluster/ansibleexec]
module.ansibleexec.aws_iam_role.role: Refreshing state... [id=ansibleexec_ECSTaskRole]
module.ansibleexec.aws_ecr_repository.repository: Refreshing state... [id=ansibleexec]
module.ansibleexec.aws_ecr_repository_policy.policy: Refreshing state... [id=ansibleexec]
module.ansibleexec.aws_ecr_lifecycle_policy.lifecycle: Refreshing state... [id=ansibleexec]
module.ansibleexec.aws_ecs_task_definition.task: Refreshing state... [id=ansibleexec]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ansibleexec.aws_ecr_lifecycle_policy.lifecycle has been deleted
  - resource "aws_ecr_lifecycle_policy" "lifecycle" {
      - id          = "ansibleexec" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Expire untagged images after 1 day"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber = 1
                          - countType   = "sinceImagePushed"
                          - countUnit   = "days"
                          - tagStatus   = "untagged"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "531133914787" -> null
      - repository  = "ansibleexec" -> null
    }

  # module.ansibleexec.aws_ecr_repository.repository has been deleted
  - resource "aws_ecr_repository" "repository" {
      - arn                  = "arn:aws:ecr:us-east-1:531133914787:repository/ansibleexec" -> null
      - id                   = "ansibleexec" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "ansibleexec" -> null
      - registry_id          = "531133914787" -> null
      - repository_url       = "531133914787.dkr.ecr.us-east-1.amazonaws.com/ansibleexec" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }

  # module.ansibleexec.aws_ecr_repository_policy.policy has been deleted
  - resource "aws_ecr_repository_policy" "policy" {
      - id          = "ansibleexec" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                          - "ecr:PutImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:UploadLayerPart",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:DescribeRepositories",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:ListImages",
                          - "ecr:DeleteRepository",
                          - "ecr:BatchDeleteImage",
                          - "ecr:SetRepositoryPolicy",
                          - "ecr:DeleteRepositoryPolicy",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::531133914787:user/testUser",
                            ]
                        }
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - registry_id = "531133914787" -> null
      - repository  = "ansibleexec" -> null
    }

  # module.ansibleexec.aws_iam_role.role has been deleted
  - resource "aws_iam_role" "role" {
      - arn                   = "arn:aws:iam::531133914787:role/ansibleexec_ECSTaskRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = "ECSTaskExecution"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-03-22T05:28:51Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ansibleexec_ECSTaskRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ansibleexec_ECSTaskRole" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAXXKQML2RVQZRYKSE3" -> null

      - inline_policy {}
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ansibleexec.aws_ecr_lifecycle_policy.lifecycle will be created
  + resource "aws_ecr_lifecycle_policy" "lifecycle" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images after 1 day"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "ansibleexec"
    }

  # module.ansibleexec.aws_ecr_repository.repository will be created
  + resource "aws_ecr_repository" "repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ansibleexec"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.ansibleexec.aws_ecr_repository_policy.policy will be created
  + resource "aws_ecr_repository_policy" "policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:DescribeRepositories",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:ListImages",
                          + "ecr:DeleteRepository",
                          + "ecr:BatchDeleteImage",
                          + "ecr:SetRepositoryPolicy",
                          + "ecr:DeleteRepositoryPolicy",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::531133914787:user/testUser",
                            ]
                        }
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "ansibleexec"
    }

  # module.ansibleexec.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:531133914787:task-definition/ansibleexec:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "531133914787.dkr.ecr.us-east-1.amazonaws.com/ansibleexec:latest"
                  - mountPoints      = []
                  - name             = "ansibleexec"
                  - portMappings     = []
                  - volumesFrom      = []
                  - workingDirectory = "/var/ansibleexec"
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ execution_role_arn       = "arn:aws:iam::531133914787:role/ansibleexec_ECSTaskRole" -> (known after apply) # forces replacement
      ~ id                       = "ansibleexec" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ansibleexec.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTaskExecution"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ]
      + max_session_duration  = 3600
      + name                  = "ansibleexec_ECSTaskRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 1 to destroy.


```

</details>

*Pusher: @fer1035, Action: `pull_request`*